//地圖上的點位
//0,0,0為實際車子地圖位置(x , y , yaw)，mapX 和 mapY 是相對於地圖的百分比
const initialPoints = [
  { name: "朱建樺", id: 1, x: 0.35, y: 0, yaw: 0.0, mapX: "37%", mapY: "24%" }, // eddie
  { name: "廖育樞", id: 2, x: 0.35, y: 2.03, yaw: 1.57, mapX: "24.5%", mapY: "24%" }, //育
  { name: "陳柏傑", id: 3, x: 0.35, y: 3.609, yaw: 1.57, mapX: "14%", mapY: "24%" }, //柏
  { name: "溫千豪", id: 4, x: 2.652, y: 0.082, yaw: -1.57, mapX: "36%", mapY: "7%" }, //千
  { name: "樊期斌", id: 5, x: 2.917, y: -0.908, yaw: -1.57, mapX: "45%", mapY: "7%" }, //樊 -1.108
  { name: "瑋晟,亮智", id: 6, x: -2.838, y: -5.0195, yaw: 1.57, mapX: "66%", mapY: "43.5%" }, //賴 亮
  { name: "建銘,宇翔", id: 7, x: -5.8129, y: -6.564, yaw: 1.57, mapX: "78%", mapY: "65%" }, //翔 銘
  { name: "測試點位", id: 8, x: 2.0124, y: 1.7173, yaw: 0.0, mapX: "26%", mapY: "7%" }, //辦公室 測試站點1
  { name: "林怡均", id: 9, x: -3.6348, y: -0.053, yaw: 3.14, mapX: "38%", mapY: "49.5%" }, // 均
  { name: "林曉瑩", id: 10, x: -3.8091, y: 1.4766, yaw: 3.14, mapX: "28%", mapY: "49.5%" }, //瑩
  { name: "黃紹傑", id: 11, x: -5.2672, y: 4.2336, yaw: 0.0, mapX: "11.75%", mapY: "59%" }, //黃
  { name: "蔡建樑", id: 12, x: -3.6348, y: 1.4766, yaw: 0.0, mapX: "28%", mapY: "46%" }, // 蔡
  { name: "黃子洋", id: 13, x: -7.5311, y: 1.7288, yaw: 1.57, mapX: "27%", mapY: "73%" }, //黃
  { name: "胡嘉鴻", id: 14, x: -7.4907, y: 3.3823, yaw: -1.57, mapX: "16%", mapY: "73%" }, //胡
  { name: "陳奕如", id: 15, x: -7.3136, y: 0.1055, yaw: -1.57, mapX: "36%", mapY: "73%" }, //陳
  { name: "徐子涵", id: 16, x: -3.604, y: -7.748, yaw: -1.57, mapX: "81%", mapY: "49%" }, //涵
];

export default initialPoints;
